# Pandas II - Data Cleaning

_September 17, 2020_

Agenda today:
- Introduction to lambda function
- Introduction to data cleaning in pandas
- Combining DataFrames
- Optional Exercises

In [10]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

## Part I. Lambda function
lambda functions are known as anonymous functions in Python. It allows you to write one-line functions that are used together with `map()`, `filter()`.

Syntax of lambda function: `lambda arguments:expressions`.

In [11]:
# lambda function with one argument
func_1 = lambda x:x+10
func_1(10)

20

In [14]:
(lambda x:x+10)(10) #another way to do above^

20

In [13]:
# lambda function with multiple arguments
func_2 = lambda x, y, z: x+y+z if z + y > x else x-y+z
func_2(10,12,10)

32

In [16]:
# exercise: turn the below function into a lambda function
def count_zeros(li):
    """
    return a count of how many zeros are in a list
    """
    count = sum(x == 0 for x in li)
    return count

In [17]:
count_zeros([1,2,4,0])

1

In [ ]:
map(function, collection)
filter(function, collection)

In [76]:
# your answer here
mapped = map(lambda x:x == 0,[1,1,2,4,0, 0])
next(mapped)
next(mapped)

False

In [77]:
lst = [1,2,4,0, 0]
result = list(filter(lambda x: x == 0, lst))
next(result)
next(result)
next(result)

TypeError: 'list' object is not an iterator

## Part II. Data Cleaning in Pandas
You might wonder what the usage of lambda functions are - they are incredibly useful when applied to data cleaning in Pandas. You can apply it to columns or the entire dataframe to get results you need. For example, you might want to convert a column with $USD to Euros, or temperature expressed in Celsius to Fehrenheit. You will learn three new functions:

- `Apply()` - on both series and dataframe

- `Applymap()` - only on dataframes

- `Map()` - only on series

In [57]:
# import the dataframe 
df = pd.read_csv('auto-mpg.csv')

In [58]:
# examine the first few rows of it 
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [59]:
# check the datatypes of the df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
mpg             398 non-null float64
cylinders       398 non-null int64
displacement    398 non-null float64
horsepower      398 non-null object
weight          398 non-null int64
acceleration    398 non-null float64
model year      398 non-null int64
origin          398 non-null int64
car name        398 non-null object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [68]:
# check whether you have missing values
df.isna().sum()

mpg             0
cylinders       0
displacement    0
horsepower      0
weight          0
acceleration    0
model year      0
origin          0
car name        0
dtype: int64

In [ ]:
# creating new columns - broadcasting

In [179]:
# check the dataframe

In [70]:
# time to use lambda and apply! with apply, applymap, and map, you never need to "iterate through the rows"

# create a function that takes in the weight as lbs, and return weight in tons 

# 1 lb = 0.0005


df['tonnage'] = df['weight'].apply(lambda x: x * 0.0005)
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,tonnage
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,1.7180
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,1.7165
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,1.7245
...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl,1.3950
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup,1.0650
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage,1.1475
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger,1.3125
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10,1.3600

In [71]:
#broadcasting

df['weight_broadcast'] = df['weight'] * 0.0005
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,tonnage,weight_broadcast
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,1.7520,1.7520
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,1.8465,1.8465
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,1.7180,1.7180
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,1.7165,1.7165
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,1.7245,1.7245
...,...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl,1.3950,1.3950
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup,1.0650,1.0650
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage,1.1475,1.1475
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger,1.3125,1.3125
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10,1.3600,1.3600

In [81]:
# exercise - create a new column called "years old", which determines how old a car is 

df['years_old'] = df['model_year'].apply(lambda x: 120 - x if x >= 70 else x)  #lambda function
#^useful because  you can chain conditionals 

df['year_old'] = 120 - df['model year'] #broadcasting

df

KeyError: 'model_year'

## Part III. Combining DataFrames in Pandas
There are two methods in Pandas that allow us to combine our DataFrames:

    - df.merge() - allow us to match dataframes on either indices or columns
    - df.concat() - allow us to concatenate two dataframes vertically or horizontally

In [180]:
# create some toy dataframes 
import pandas as pd
import numpy as np
small_grades = pd.DataFrame({"students":["Amelia","Justin W","Brendan"],
                          "projects":[1,2,1],
                          "grades":np.random.randint(80,100,3)})
small_quiz = pd.DataFrame({"students":["Billy","Cierra","Justin W"],
                            "quiz_score":np.random.randint(0,10,3)})

In [181]:
small_grades

   students  projects  grades
0    Amelia         1      85
1  Justin W         2      92
2   Brendan         1      99

In [182]:
small_quiz

   students  quiz_score
0     Billy           6
1    Cierra           2
2  Justin W           4

In [185]:
### df.concat 
combined = pd.concat([small_grades, small_quiz], axis = 0)
combined

/Users/brendanferris/opt/anaconda3/envs/learn-env/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

   grades  projects  quiz_score  students
0    85.0       1.0         NaN    Amelia
1    92.0       2.0         NaN  Justin W
2    99.0       1.0         NaN   Brendan
0     NaN       NaN         6.0     Billy
1     NaN       NaN         2.0    Cierra
2     NaN       NaN         4.0  Justin W

<img src = 'sql-joins.png' width = 400>

Based on the diagram above, what are the differences of different types of merge?

In [186]:
### df.merge

small_grades.merge(small_quiz, on = 'students')

# inner merge

   students  projects  grades  quiz_score
0  Justin W         2      92           4

In [187]:
# outer merge

small_grades.merge(small_quiz, how = 'outer', on = 'students')

   students  projects  grades  quiz_score
0    Amelia       1.0    85.0         NaN
1  Justin W       2.0    92.0         4.0
2   Brendan       1.0    99.0         NaN
3     Billy       NaN     NaN         6.0
4    Cierra       NaN     NaN         2.0

In [188]:
# right merge

small_grades.merge(small_quiz, how = 'right', on = 'students')

   students  projects  grades  quiz_score
0  Justin W       2.0    92.0           4
1     Billy       NaN     NaN           6
2    Cierra       NaN     NaN           2

### Data Cleaning - level up with the adult dataset

Dataset documentation:
- age: continuous.
- workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- fnlwgt: continuous.
- education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- education-num: continuous.
- marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- sex: Female, Male.
- capital-gain: continuous.
- capital-loss: continuous.
- hours-per-week: continuous.
- native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.

In [147]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'
adults = pd.read_csv(url,header = None)

In [148]:
# Check the first few rows 
adults.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [149]:
# add the columns to dataset
columns = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital_status','occupation', 'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_per_week', 'native_country','income']

In [150]:
#adding new column names from list
adults.columns = columns

In [190]:
adults

,age,workclass,fnlwgt,education,education-num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [152]:
# check the info of dataset
adults.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital_status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital_gain      32561 non-null int64
capital_loss      32561 non-null int64
hours_per_week    32561 non-null int64
native_country    32561 non-null object
income            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [153]:
# check missing values
adults.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
income            0
dtype: int64

In [162]:
# perform some queries - find the total num female & bachelors


criteria_1 = adults['sex'] == 'Female'
criteria_2 = adults['education'] == 'Bachelors'

adults[(criteria_1) & (criteria_2)]

Empty DataFrame
Columns: [age, workclass, fnlwgt, education, education-num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income]
Index: []

In [193]:
adults['income'] = adults['income'].astype(str).str.strip()
adults_cat = adults["income"].astype('category')
adults_cat.cat

In [ ]:
# seems like we have data anolmaly, find out what that is and fix it 
# hint - tons of entries contain white space, remove it!

In [195]:
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
# subsetting multiple cols

In [ ]:
# create a column called income_binary, 1 if >50k and 0 otherwise

adult_ca

In [ ]:
# get some descriptive statistics of the income distribution